DancingLinks.org
#+title: Dancing Links in Javascript
#+OPTIONS: num:nil
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org-overrides.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="chessboards.css" />

* Introduction

  If you have never heard of it, [[http://www-cs-faculty.stanford.edu/~uno/papers/dancing-color.ps.gz][Dancing Links]] is one of the
  techniques that Knuth describes to implement a recursive
  backtracking algorithm.  If you truly want a good treatment as to
  what the technique is, I can not recommend going straight to the
  source heavily enough.

  I originally thought of the "Dancing Links" technique as one that is
  solely suited to solving "exact cover" problems.  This actually
  caused me to not attempt implementing it for a time, as I confess it
  intimidated me.  Also, I'm not entirely sure I have ever had to work
  such a problem in my day jobs.

  Regardless, I have been intrigued by the technique, if only for the
  name, for quite a while.  This, then, is my attempt at implementing
  the algorithm that was used to introduce the technique.  I'm hoping
  to use the technique in another algorithm later.

* N-Queens

  I'll be exploring dancing links in solving a straight forward "exact
  cover" problem.  This will be, directly, the DLX algorithm that was
  used in introducing the technique.

  For those that do not know, the "$N$-Queens" problem is one of how
  to place $N$ queens that are not attacking each other on an $N
  \times N$ chessboard.  Simply stated, we want to pick a solution
  where we have a queen in every row, column, diagonal, and reverse
  diagonal.

  The basic algorithm for solving this is to place one piece, then see
  if you can place another piece on the spaces remaining.  Continue
  until you place $N$ pieces or can not place another.  In either
  event, you simply take off pieces that you have placed and try
  a different placement.

  It can be seen that this is a depth first search across all possible
  piece placements.  Simply start with all possible positions, pick a
  starting point, remove all positions it eliminates, and repeat.

** Basic Recursion

   A ridiculously naive solution follows.  My strategy is simply to go
   as stated above.  Start by enumerating all positions on the board.
   Pick one, add it to our list of "moves taken," remove all positions
   it eliminates, and call ourselves starting over.  When we return
   from the recursive call, try the next position in our list.

   This method is short enough that I will just put the whole thing
   here.  I will also add that that is a benefit for this approach.
   The DLX version turns out to be a lot more code.

   #+name: basic_algorithm
   #+begin_src js  :tangle naiveRecursion.js :comments link
     function solveRecursively(n, showSteps) {
         var r = n, c = n, allPositions,
             steps = [];

         function initializePositions() {
             var i, j;
             allPositions = [];
             for (i = 0; i < r; i++) {
                 for (j = 0; j < c; j++) {
                     allPositions.push({
                         r: i,
                         f: j,
                         a: i + j,
                         b: n - 1 - j + i,
                         //To get our placements the same as the DLX one...
                         toString: function() {
                             return "R"+this.r+" F"+this.f+" A"+this.a+" B"+this.b;
                         }
                     });
                 }
             }
         }

         function placePiece(availablePositions, position) {
             return availablePositions.
                 filter(function(v) {
                     return v.r !== position.r &&
                         v.f !== position.f &&
                         v.a !== position.a &&
                         v.b !== position.b;
                 });
         }

         function testSolution(availablePositions, candidate) {
             if (showSteps)
                 steps.push(candidate);

             if (availablePositions.length) {
                 var childSolutions = [];
                 for (var p = 0; p < Math.min(n, availablePositions.length); p++) {
                     var position = availablePositions[0],
                         remainingPositions = placePiece(availablePositions,
                                                         position),
                         recurseResults = testSolution(remainingPositions,
                                                       candidate.concat(position));

                         availablePositions = availablePositions.slice(1);
                         childSolutions = childSolutions.concat(recurseResults);
                 }
                 return childSolutions;
             } else if (candidate.length === n) {
                 return [ candidate ];
             }
             return [];
         }

         initializePositions();
         var solutions = testSolution(allPositions, []);
         if (showSteps)
             return steps;
         return solutions;
     }

   #+end_src

   Quickly running this, we see that it has the expected results for
   various small values.  I did not try for much larger values as I
   don't exactly have high hopes for speed there.  Just running for 10
   nodes already takes a bit of time.  (Well, a second or so.  Feels
   like forever.  Bumping up to 11 starts taking tens of seconds.)

   #+begin_src js :noweb yes :exports results
     <<basic_algorithm>>

     return [['$N$', 'Solutions'],
             [1, solveRecursively(1).length],
             [2, solveRecursively(2).length],
             [3, solveRecursively(3).length],
             [4, solveRecursively(4).length],
             [5, solveRecursively(5).length],
             [6, solveRecursively(6).length],
             [7, solveRecursively(7).length],
             [8, solveRecursively(8).length]];
   #+end_src

   #+RESULTS:
   | $N$ | Solutions |
   |   1 |         1 |
   |   2 |         0 |
   |   3 |         0 |
   |   4 |         2 |
   |   5 |        10 |
   |   6 |         4 |
   |   7 |        40 |
   |   8 |        92 |


** Dancing Links

   Now that we've looked at solving this with a naive recursive
   solution, how would this look with dancing links?  Not going to
   lie, this is more involved.  Luckily, it isn't that terribly scary.

   In fact, the actual dancing links code is rather short and not too
   terribly involved.  Because I did not bother to clean up the code
   that generates the data for the $N$-queens problem, this section is
   large.

   We'll look at this in pieces, then.  If you want to see it all
   tangled into a single file, peek over at [[./dancingLinks.js][dancingLinks.js]].

