DancingLinks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Dancing Links in Javascript</title>
<!-- 2016-09-04 Sun 16:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
<link rel="stylesheet" type="text/css" href="chessboards.css" />
</head>
<body>
<div id="content">
<h1 class="title">Dancing Links in Javascript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">N-Queens</a>
<ul>
<li><a href="#sec-2-1">Basic Recursion</a></li>
<li><a href="#sec-2-2">Dancing Links</a>
<ul>
<li><a href="#sec-2-2-1">Outline</a></li>
<li><a href="#sec-2-2-2">Search</a></li>
<li><a href="#sec-2-2-3">Covering and Uncovering Columns</a></li>
<li><a href="#sec-2-2-4">Utility Methods</a></li>
<li><a href="#sec-2-2-5">Generate Headers</a></li>
<li><a href="#sec-2-2-6">Running for small values</a></li>
</ul>
</li>
<li><a href="#sec-2-3">Visualized</a>
<ul>
<li><a href="#sec-2-3-1">Recursive solution</a></li>
<li><a href="#sec-2-3-2">Dancing Links solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Conclusion</a></li>
<li><a href="#sec-4">Addendum</a></li>
<li><a href="#sec-5">Appendix</a>
<ul>
<li><a href="#sec-5-1">Board Highlighting</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
If you have never heard of it, <a href="http://www-cs-faculty.stanford.edu/~uno/papers/dancing-color.ps.gz">Dancing Links</a> is one of the
techniques that Knuth describes to implement a recursive
backtracking algorithm.  If you truly want a good treatment as to
what the technique is, I can not recommend going straight to the
source heavily enough.
</p>

<p>
I originally thought of the "Dancing Links" technique as one that is
solely suited to solving "exact cover" problems.  This actually
caused me to not attempt implementing it for a time, as I confess it
intimidated me.  Also, I'm not entirely sure I have ever had to work
such a problem in my day jobs.
</p>

<p>
Regardless, I have been intrigued by the technique, if only for the
name, for quite a while.  This, then, is my attempt at implementing
the algorithm that was used to introduce the technique.  I'm hoping
to use the technique in another algorithm later.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">N-Queens</h2>
<div class="outline-text-2" id="text-2">
<p>
I'll be exploring dancing links in solving a straight forward "exact
cover" problem.  This will be, directly, the DLX algorithm that was
used in introducing the technique.
</p>

<p>
For those that do not know, the "\(N\)-Queens" problem is one of how
to place \(N\) queens that are not attacking each other on an \(N
  \times N\) chessboard.  Simply stated, we want to pick a solution
where we have a queen in every row, column, diagonal, and reverse
diagonal.
</p>

<p>
The basic algorithm for solving this is to place one piece, then see
if you can place another piece on the spaces remaining.  Continue
until you place \(N\) pieces or can not place another.  In either
event, you simply take off pieces that you have placed and try
a different placement.
</p>

<p>
It can be seen that this is a depth first search across all possible
piece placements.  Simply start with all possible positions, pick a
starting point, remove all positions it eliminates, and repeat.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Basic Recursion</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A ridiculously naive solution follows.  My strategy is simply to go
as stated above.  Start by enumerating all positions on the board.
Pick one, add it to our list of "moves taken," remove all positions
it eliminates, and call ourselves starting over.  When we return
from the recursive call, try the next position in our list.
</p>

<p>
This method is short enough that I will just put the whole thing
here.  I will also add that that is a benefit for this approach.
The DLX version turns out to be a lot more code.
</p>

<div class="org-src-container">

<pre class="src src-js" id="basic_algorithm">function solveRecursively(n, showSteps) {
    var r = n, c = n, allPositions,
	steps = [];

    function initializePositions() {
	var i, j;
	allPositions = [];
	for (i = 0; i &lt; r; i++) {
	    for (j = 0; j &lt; c; j++) {
		allPositions.push({
		    r: i,
		    f: j,
		    a: i + j,
		    b: n - 1 - j + i,
		    //To get our placements the same as the DLX one...
		    toString: function() {
			return "R"+this.r+" F"+this.f+" A"+this.a+" B"+this.b;
		    }
		});
	    }
	}
    }

    function placePiece(availablePositions, position) {
	return availablePositions.
	    filter(function(v) {
		return v.r !== position.r &amp;&amp;
		    v.f !== position.f &amp;&amp;
		    v.a !== position.a &amp;&amp;
		    v.b !== position.b;
	    });
    }

    function testSolution(availablePositions, candidate) {
	if (showSteps)
	    steps.push(candidate);

	if (availablePositions.length) {
	    var childSolutions = [];
	    for (var p = 0; p &lt; Math.min(n, availablePositions.length); p++) {
		var position = availablePositions[0],
		    remainingPositions = placePiece(availablePositions,
						    position),
		    recurseResults = testSolution(remainingPositions,
						  candidate.concat(position));

		    availablePositions = availablePositions.slice(1);
		    childSolutions = childSolutions.concat(recurseResults);
	    }
	    return childSolutions;
	} else if (candidate.length === n) {
	    return [ candidate ];
	}
	return [];
    }

    initializePositions();
    var solutions = testSolution(allPositions, []);
    if (showSteps)
	return steps;
    return solutions;
}
</pre>
</div>

<p>
Quickly running this, we see that it has the expected results for
various small values.  I did not try for much larger values as I
don't exactly have high hopes for speed there.  Just running for 10
nodes already takes a bit of time.  (Well, a second or so.  Feels
like forever.  Bumping up to 11 starts taking tens of seconds.)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">\(N\)</td>
<td class="right">Solutions</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">0</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">0</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">10</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">7</td>
<td class="right">40</td>
</tr>

<tr>
<td class="right">8</td>
<td class="right">92</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Dancing Links</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Now that we've looked at solving this with a naive recursive
solution, how would this look with dancing links?  Not going to
lie, this is more involved.  Luckily, it isn't that terribly scary.
</p>

<p>
In fact, the actual dancing links code is rather short and not too
terribly involved.  Because I did not bother to clean up the code
that generates the data for the \(N\)-queens problem, this section is
large.
</p>

<p>
We'll look at this in pieces, then.  If you want to see it all
tangled into a single file, peek over at <i>dancingLinks.js</i>.
</p>
</div>
