DancingLinks.html

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">Outline</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The basic outline is to create a method that will take in the
number of queens we want to solve, and then create the necessary
structures to make it happen.
</p>

<div class="org-src-container">

<pre class="src src-js" id="dlx_algorithm">function solveWithDancingLinks(n, showSteps) {
    var headers, solutions = [], O = [];

    &lt;&lt;dlx_initialize_headers&gt;&gt;

    &lt;&lt;dlx_search&gt;&gt;

    &lt;&lt;dlx_cover_uncover&gt;&gt;

    &lt;&lt;dlx_utilities&gt;&gt;


    initializeHeaders();
    search(0);
    return solutions;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">Search</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
We'll begin by looking at the search code.  This is fairly
straight forward.  First, check to see if there are any columns
left uncovered and return the current solution if not.  Otherwise,
pick a column, cover it, then for each row in the current column,
cover all connected columns and continue the search.
</p>

<p>
One thing to note here is if we pick a column that has zeros rows
on it, we immediately backtrack up and try a different path.
</p>

<div class="org-src-container">

<pre class="src src-js" id="dlx_search">function search(k) {
    var c, r;
    if (showSteps || headers.right === headers) {
	solutions.push(copySolution());
	if (headers.right == headers)
	    return;
    }
    c = smallestColumn();
    cover(c);
    r = c.down;
    while (r !== c) {
	O.push(printRow(r));
	r = r.right;
	while (r.col !== c) {
	    cover(r.col);
	    r = r.right;
	}
	search(k + 1);
	r = r.left;
	while (r.col !== c) {
	    uncover(r.col);
	    r = r.left;
	}
	r = r.down;
	O.pop();
    }
    uncover(c);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">Covering and Uncovering Columns</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This is actually the heart of the "dancing" in the dancing links
technique.  Not much to offer on them other than that they have to
run in reverse order from each other for our purposes.  Both
methods are included here.
</p>

<div class="org-src-container">

<pre class="src src-js" id="dlx_cover_uncover">function cover(c) {
    var r = c.down;
    c.right.left = c.left;
    c.left.right = c.right;
    while (r !== c) {
	r = r.right;
	while (r.col !== c) {
	    r.up.down = r.down;
	    r.down.up = r.up;
	    r.col.size--;
	    r = r.right;
	}
	r = r.down;
    }
}

function uncover(c) {
    var r = c.up;
    c.right.left = c;
    c.left.right = c;
    while (r !== c) {
	r = r.left;
	while (r.col !== c) {
	    r.up.down = r;
	    r.down.up = r;
	    r.col.size++;
	    r = r.left;
	}
	r = r.up;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">Utility Methods</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
The rest of the methods we need are fairly self explanatory.
</p>

<div class="org-src-container">

<pre class="src src-js" id="dlx_utilities">function smallestColumn() {
    var h, c, s = Number.MAX_VALUE;
    h = headers.right;
    while (h !== headers) {
	if (h.size &lt; s) {
	    c = h;
	    s = c.size;
	}
	h = h.right;
    }
    return c;
}
function printRow(r) {
    var s = r.col.name + ' ', e = r;
    r = r.right;
    while (r !== e) {
	s += r.col.name + ' ';
	r = r.right;
    }
    return s;
}
function copySolution() {
    var solution = [].concat(O);
    return solution;
}
</pre>
</div>
</div>
</div>
