DancingLinks.html

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">Generate Headers</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
And now, the only part of this code that is actually specific to
the queens problem, generating the rows and columns of our data
structure.
</p>

<p>
The basic idea is to generate a primary column for each rank and
file, then secondary columns for each diagonal.  Primary columns
are doubly linked to the 'root' column, whereas secondary ones are
not.  Knuth points out that you can get further speed increases by
creating the headers in "pipe organ" order.  I confess I had to
just use his method for generating said order, as I did not know
it.
</p>

<p>
This does make a very interesting example where it is not just the
data structure that matters, but how you initialize it.  Using the
"pipe organ" order can cut the running time by half, compared to
the straight forward ordering.
</p>

<p>
The only trick this required is that I do keep an array of all
columns while making them so that I can find the ones that are not
hooked into the main header list.  (After I did this, I took a
look directly at Knuth's <a href="http://www-cs-faculty.stanford.edu/~uno/programs/dance.w">code</a> to see how he does it.  Kind of sad
to see how much easier this is to do in C.  I can't say I would
have done it the easy way, though.  I do not think of pointer
tricks quickly.)
</p>

<div class="org-src-container">

<pre class="src src-js" id="dlx_initialize_headers">function initializeHeaders() {
    var i, j, k, rows=[];
    cols = [];

    headers = {
	name: 'root',
	right: null,
	left: null,
	up: null,
	down: null
    };
    headers.right = headers;
    headers.left = headers;

    for (i = 0; i &lt; n; i++) {
	var t = ((i &amp; 1) ? n - 1 - i : n + i) &gt;&gt; 1;
	var cur = {
	    name: 'R' + t,
	    right: headers,
	    left: headers.left,
	    size: 0,
	    down: null,
	    up: null,
	};
	cols.push(cur);
	headers.left.right = cur;
	headers.left = cur;
	cur.up = cur;
	cur.down = cur;

	cur = {
	    name: 'F' + t,
	    right: headers,
	    left: headers.left,
	    size: 0,
	    down: null,
	    up: null,
	};
	cols.push(cur);
	headers.left.right = cur;
	headers.left = cur;
	cur.up = cur;
	cur.down = cur;
    }
    for (i = 0; i &lt; 2 * n; i++) {
	    var cur = {
		name: 'A' + i,
		right: null,
		left: null,
		size: 0,
		up: null,
		down: null
	    };
	    cols.push(cur);
	    cur.left = cur;
	    cur.right = cur;
	    cur.up = cur;
	    cur.down = cur;
    }
    for (i = 0; i &lt; 2 * n; i++) {
	    var cur = {
	    name: 'B' + i,
		right: null,
		left: null,
		size: 0,
		up: null,
		down: null
	    };
	    cols.push(cur);
	    cur.left = cur;
	    cur.right = cur;
	    cur.up = cur;
	    cur.down = cur;
    }

    for (i = 0; i &lt; n; i++) {
	for (j = 0; j &lt; n; j++) {
	    var a, b, c, d;
	    a = {
		up: null,
		down: null,
		left: null,
		right: null,
		col: null
	    };
	    b = {
		up: null,
		down: null,
		left: null,
		right: null,
		col: null
	    };
	    c = {
		up: null,
		down: null,
		left: null,
		right: null,
		col: null
	    };
	    d = {
		up: null,
		down: null,
		left: null,
		right: null,
		col: null
	    };
	    a.left = d;
	    a.right = b;
	    b.left = a;
	    b.right = c;
	    c.left = b;
	    c.right = d;
	    d.left = c;
	    d.right = a;

	    var colIdx = 0;
	    var aCol = cols[colIdx++];
	    while (aCol.name !== 'R' + i)
		aCol = cols[colIdx++];
	    aCol.size++;
	    a.col = aCol;
	    a.down = aCol;
	    a.up = aCol.up;
	    a.down.up = a;
	    a.up.down = a;

	    colIdx = 0;
	    var bCol = cols[colIdx++];
	    while (bCol.name !== 'F' + j) {
		bCol = cols[colIdx++];
	    }
	    bCol.size++;
	    b.col = bCol;
	    b.down = bCol;
	    b.up = bCol.up;
	    b.down.up = b;
	    b.up.down = b;

	    colIdx = 0;
	    var cCol = cols[colIdx++];
	    while (cCol.name !== 'A' + (j + i))
		cCol = cols[colIdx++];
	    cCol.size++;
	    c.col = cCol;
	    c.down = cCol;
	    c.up = cCol.up;
	    c.down.up = c;
	    c.up.down = c;

	    colIdx = 0;
	    var dCol = cols[colIdx++];
	    while (dCol.name !== 'B' + (n - 1 - j + i))
		dCol = cols[colIdx++];
	    dCol.size++;
	    d.col = dCol;
	    d.down = dCol;
	    d.up = dCol.up;
	    d.up.down = d;
	    d.down.up = d;
	}
    }
    headers = headers.right;
    while (headers.down) {
	if (headers.size === 0) {
	    headers.left.right = headers.right;
	    headers.right.left = headers.left;
	}
	headers = headers.right;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">Running for small values</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
And finally, we run for some quick examples to see what we can
see.  I'm willing to show quite a few more results for this case,
as they go <b>much</b> faster than the recursive solution I created.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">\(N\)</td>
<td class="right">Solutions</td>
</tr>

<tr>
<td class="right">1</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">2</td>
<td class="right">0</td>
</tr>

<tr>
<td class="right">3</td>
<td class="right">0</td>
</tr>

<tr>
<td class="right">4</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">5</td>
<td class="right">10</td>
</tr>

<tr>
<td class="right">6</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">7</td>
<td class="right">40</td>
</tr>

<tr>
<td class="right">8</td>
<td class="right">92</td>
</tr>

<tr>
<td class="right">9</td>
<td class="right">352</td>
</tr>

<tr>
<td class="right">10</td>
<td class="right">724</td>
</tr>

<tr>
<td class="right">11</td>
<td class="right">2680</td>
</tr>

<tr>
<td class="right">12</td>
<td class="right">14200</td>
</tr>

<tr>
<td class="right">13</td>
<td class="right">73712</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Visualized</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I had originally thought to run some fairly sophisticated
visualizations of these two algorithms.  Truth to tell, I just
can't think of any amazing visualization that is that enlightening.
</p>

<p>
However, running the visualization of my DLX algorithm where I just
see what board positions it tries did help me spot a bug in my
code.  So, I'll include what I did.  If you want to just play with
some larger visualizations, simply run:
</p>

<div class="org-src-container">

<pre class="src src-js">document.body.appendChild(makeVisualization(N, solveWithDancingLinks));
</pre>
</div>

<p>
To see the boards that the recursive solution inspects, use
"solveRecursively."
</p>
</div>
