DancingLinks.org
*** Recursive solution

    First thing I was curious on was if I could get a good grasp on
    the speed difference at a lower value of $N$.  Sure enough, there
    is enough to look at.  We'll begin by looking at the recursive
    solution.

    The basic problem is this algorithm hits a lot of tree states
    where it is not possible to fully cover.  In particular, notice
    that from position 2 to position 3, it *is* possible to place
    another queen, however, it is *not* possible to place a queen on
    the last file.  So, the algorithm should be able to backtrack
    early.  Instead, it places the queen.

    Otherwise, this algorithm inspects the pieces in a very straight
    forward left to right, top to bottom method of placing pieces.

   #+begin_html
   <div id="recursiveVisualizations"></div>
   #+end_html

*** Dancing Links solution

    Contrast the previous behavior with the dancing links technique.
    Here, the ordering heuristic of Knuth's accounts for starting on
    the third row, but the natural DLX behavior is as soon as a rank
    or a file is impossible to place, the algorithm will backtrack.

    This shows in the marked decrease in number of board
    configurations tried.  For DLX, this is a nice 12 positions
    instead of the 31 previously.

    To see the specific scenario that helps, notice from configuration
    6 to 7, there *is* a place a queen could be placed, but the system
    does not bother trying, as the third rank is already impossible to
    place.

   #+begin_html
   <div id="dlxVisualizations"></div>
   #+end_html


* Conclusion

  After all of that, what is the reason to use the "dancing links"
  technique?  Mainly for speed.  It seems to be a classic case study
  in using a fair bit more memory for the main data in order to more
  easily backtrack on modifications to it.

  It should be possible to use something akin to the same ordering
  heuristic in the naive recursive solution that the dancing links
  version uses.  However, the linked nature of the nodes in the DLX
  algorithm makes it straight forward to find what position of the
  board to try next.  There is plenty of following links, but there is
  relatively little "searching" to find whichc piece to modify.

  Also, please note that the point of the technique is to show how
  modifying a datastructure can sometimes easily be undone.  All in
  all it is more difficult to build up the main data structure, but
  manipulating it is very fast.

  Finally, I am considering using this technique elsewhere.  There are
  a few oddities to it that will likely stonewall this effort.
  Mainly, I am definitely more comfortable with "immutable" data
  structures.  At least the simple ones.

* Addendum

  I should also put a big plug in to the literate programming ideas,
  again.  To note, this document is not just excerpts of the code, but
  rather the full source code for everything I did.  It can be tangled
  into the different files.

  I'm torn on really recommending this style for full projects.  I
  think it sadly lends itself better to pieces where one person does
  it all.  However, even working in a team it is not uncommon for a
  few people to develop sections on their own.  Perhaps it could work
  better in a team than I am giving it credit.

  I will say that reading Knuth's code directly is both easier and
  more of a learning experience than was originally anticipated.
  There is definitely a mythos that surrounds his work that convinces
  many to think they can't read it.  I will not claim the heavier math
  is easy.  Nor will I claim all of the exercises are.  I will say
  that it is easier than it is typically portrayed.  Especially just
  the programming sections.

* Appendix

